app/views/riders/wait.html.haml

                =f.hidden_field :rider_id, value:@rider.id
                =f.hidden_field :driver_id, value:Driver.first.id
---
SELECT  "drivers".* FROM "drivers"  ORDER BY "drivers"."id" ASC LIMIT 1