app/controllers/drivers_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "drivers" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2015-04-16 17:34:53.661648"], ["updated_at", "2015-04-16 17:34:53.661648"]]
---
  def create
    @user = User.find(params[:user_id])
    if @user.driver
      # user is already ready to drive
      flash[:notice] = 'You have already made yourself available to drive'
      @driver = @user.driver
      redirect_to(user_driver_wait_path(@user, @driver)) and return
    end
    #build sets the product foreign key automatically
    @driver = Driver.new
    @user.driver = @driver

    if @driver.save

SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "drivers" WHERE "drivers"."id" = ?  [["id", 4]]
---
  def destroy
    @driver = Driver.find(params[:id])
    @user = User.find(@driver.user_id)
    @driver.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "riders"
---
  def wait
    @num_ahead = num - 1
    @user = User.find(params[:user_id])
    @driver = @user.driver
    if Rider.count>=1