app/controllers/rides_controller.rb

SELECT  "riders".* FROM "riders" WHERE "riders"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "riders" WHERE "riders"."id" = ?  [["id", 2]]
DELETE FROM "drivers" WHERE "drivers"."id" = ?  [["id", 2]]
INSERT INTO "rides" ("user_r_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_r_id", 1], ["created_at", "2015-04-29 18:58:57.386665"], ["updated_at", "2015-04-29 18:58:57.386665"]]
---
  def create
    #only the rider does this function
    @rider = Rider.find(params["ride"][:rider_id])
    @driver = Driver.find(params["ride"][:driver_id])
    @ride = Ride.new
    @rider.user.ride_as_rider = @ride
    @driver.user.ride_as_driver = @ride
    @rider.destroy
    @driver.destroy

    params[:ride_id] = @ride.id

    @ride.save

SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "rides" SET "start_location" = ?, "end_location" = ?, "updated_at" = ? WHERE "rides"."id" = ?  [["start_location", "Frank"], ["end_location", "Downtown"], ["updated_at", "2015-04-30 22:49:48.050236"], ["id", 1]]
---
  def update_location
    @ride = Ride.find params[:ride_id]
    @ride.update(create_update_params)

SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "rides" SET "driver_at_pickup" = ?, "updated_at" = ? WHERE "rides"."id" = ?  [["driver_at_pickup", "t"], ["updated_at", "2015-04-30 22:54:48.654960"], ["id", 1]]
---
  def update_drive_to_pickup
	 @ride = Ride.find(params[:ride_id])
	 @ride.driver_at_pickup = true
	 @ride.save

SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "rides" SET "driver_pickup_confirm" = ?, "updated_at" = ? WHERE "rides"."id" = ?  [["driver_pickup_confirm", "t"], ["updated_at", "2015-04-30 22:55:08.183225"], ["id", 1]]
---
  def update_pickup_rider
	 @ride = Ride.find(params[:ride_id])
	 @ride.driver_pickup_confirm = true
	 @ride.save

SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "rides" SET "rider_pickup_confirm" = ?, "updated_at" = ? WHERE "rides"."id" = ?  [["rider_pickup_confirm", "t"], ["updated_at", "2015-04-30 22:54:54.494802"], ["id", 1]]
---
  def update_picked_up
	 @ride = Ride.find(params[:ride_id])
	 @ride.rider_pickup_confirm = true
	 @ride.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def update_dropoff_rider
	 @ride = Ride.find(params[:ride_id])
	 @user = User.find(@ride.user_d_id)

SELECT  "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "rides".* FROM "rides" WHERE "rides"."user_r_id" = ? LIMIT 1  [["user_r_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_location
    byebug
    @ride = Ride.find(params[:ride_id])
    @user = User.find([@ride.user_r_id]).first