app/controllers/rides_controller.rb

UPDATE "rides" SET "start_location" = ?, "end_location" = ?, "updated_at" = ? WHERE "rides"."id" = ?  [["start_location", "Frank"], ["end_location", "Downtown!"], ["updated_at", "2015-04-30 19:52:24.997891"], ["id", 1]]
---
  def update
    byebug
    @ride = Ride.find params[:id]
    @ride.update(create_update_params)