app/controllers/riders_controller.rb

  def create
    @user = User.find(params[:user_id])
    if @user.rider
      # user is already waiting for a ride
      flash[:notice] = 'You have already requested a ride'
      @rider = @user.rider
      redirect_to(user_rider_wait_path(@user, @rider)) and return
    end
    #build sets the product foreign key automatically
    @rider = Rider.new
    @user.rider = @rider

    if @rider.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "riders" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2015-04-16 16:46:43.068868"], ["updated_at", "2015-04-16 16:46:43.068868"]]

  def destroy
    @rider = Rider.find(params[:id])
    @user = User.find(@rider.user_id)
    @rider.destroy
---
SELECT  "riders".* FROM "riders" WHERE "riders"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "riders" WHERE "riders"."id" = ?  [["id", 3]]

  def wait
    @num_ahead = num - 1
    @num_drivers = Driver.count
    @user = User.find(params[:user_id])
    @rider = @user.rider
    if @num_drivers>=1 && @rider.id==Rider.first.id
---
SELECT COUNT(*) FROM "drivers"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "drivers".* FROM "drivers"  ORDER BY "drivers"."id" ASC LIMIT 1
SELECT  "riders".* FROM "riders" WHERE "riders"."user_id" = ? LIMIT 1  [["user_id", 1]]