app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "sdaulton@colgate.edu"]]
---
    def logging
        email = params[:email]
        @user = User.find_by email: email

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
        id = params[:id]
        @user = User.find(id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "is_driving" = ?, "is_riding" = ?, "driver_license" = ?, "license_plate_state" = ?, "make" = ?, "model" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_driving", "f"], ["is_riding", "t"], ["driver_license", ""], ["license_plate_state", ""], ["make", ""], ["model", ""], ["updated_at", "2015-04-28 17:47:49.783908"], ["id", 1]]
---
    def update
        @user = User.find params[:id]
        @user.update(create_update_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
    def welcome
        id = params[:id]
        @user = User.find(id)